[
    {
        "code": "ACCT 166",
        "name": "SPECIAL PROBLEM",
        "descr": "",
        "credits": " 1-3",
        "preReq": "",
        "restrict": "",
        "breadth": "University: ; A&S: ",
        "typ": ""
    },
    {
        "code": "ACCT 200",
        "name": "Survey of Accounting",
        "descr": "Survey of financial and managerial accounting concepts for the non-business major. Students learn about financial statements for merchandising, manufacturing, and service companies. Topics include: accounting cycle, budgeting, standard costing, contribution margins, cost-volume-profit analysis, and decision making.",
        "credits": " 4",
        "preReq": "",
        "restrict": "Students within accounting and/or business degree programs who have received credit for ACCT 207 are not eligible to take this course without permission.",
        "breadth": "University: ; A&S: ",
        "typ": "Fall, Winter, Spring, Summer"
    },
    {
        "code": "ACCT 207",
        "name": "Accounting I",
        "descr": "An introduction to financial accounting. Topics: the accounting cycle, merchandise accounting, accounting procedures for cash, receivables, payables, inventories, plant and equipment, stocks and bonds.",
        "credits": " 3",
        "preReq": "",
        "restrict": "Not open to freshmen.",
        "breadth": "University: ; A&S: ",
        "typ": "Fall, Winter, Spring, Summer"
    },
    {
        "code": "ACCT 208",
        "name": "Accounting II",
        "descr": "Introduction to managerial accounting. Topics: manufacturing accounting, cost-volume-profit analysis, job-order accounting, budgeting, standard costs and variance analysis, contribution approach to decision analysis, absorption and variable costing.",
        "credits": " 3",
        "preReq": "ACCT 207.",
        "restrict": "Not open to freshmen. Requires a grade of C- or better in ACCT 207.",
        "breadth": "University: ; A&S: ",
        "typ": "Fall, Winter, Spring, Summer"
    },
    {
        "code": "ACCT 266",
        "name": "SPECIAL PROBLEM",
        "descr": "",
        "credits": " 1-3",
        "preReq": "",
        "restrict": "",
        "breadth": "University: ; A&S: ",
        "typ": ""
    },
    {
        "code": "ACCT 267",
        "name": "SEMINAR",
        "descr": "",
        "credits": " 1-6",
        "preReq": "",
        "restrict": "",
        "breadth": "University: ; A&S: ",
        "typ": ""
    },
    {
        "code": "ACCT 302",
        "name": "Accounting Information Systems",
        "descr": "Accounting information and its place within an organization’s overall management information system. Emphasis on information and document flow, internal control, data organization, and analysis, design, development, and audit of computer-based accounting systems. Includes some computer work.",
        "credits": " 3",
        "preReq": "ACCT 208, MISY 160 or CISC 101.",
        "restrict": "Requires sophomore status.",
        "breadth": "University: ; A&S: ",
        "typ": "Fall and Spring"
    },
    {
        "code": "ACCT 305",
        "name": "Information Security and Risk Management",
        "descr": "This course introduces the fundamental concepts of information and cybersecurity. It covers how to protect the confidentiality, integrity, and availability of data and information systems that modern organizations depend upon. The domains examined include network security, risk management, governance, physical security, cryptography, business continuity, and legal issues. Special consideration is given to studying major information security incidents and cybersecurity trends. You will learn about the threats and vulnerabilities facing computer systems and tools and techniques used to secure them.",
        "credits": " 3",
        "preReq": "MISY 160 and MISY 250.",
        "restrict": "Not open to freshmen.",
        "breadth": "University: ; A&S: ",
        "typ": ""
    }
]
